mwg.wb.webapi/soapxml/GetProductBOByProductCode.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetProductBOByProductCode xmlns="http://tempuri.org/">
      <strProductCode>{strProductCode}</strProductCode>
      <strLangID>{strLangID}</strLangID>
      <intAreaID>{intAreaID}</intAreaID>
      <intSiteID>{intSiteID}</intSiteID>
    </GetProductBOByProductCode>
  </soap:Body>
</soap:Envelope>